#!/usr/bin/env bash

GREEN="\033[0;32m"
RED="\033[0;31m"
YELLOW="\033[1;33m"
BLUE="\033[0;34m"
CYAN="\033[0;36m"
NC="\033[0m"

banner(){

clear

echo -e "${CYAN}"

cat << "EOF"

 ██████╗ ██╗     ██████╗ ██╗
██╔════╝ ██║     ██╔══██╗██║
██║  ███╗██║     ██████╔╝██║
██║   ██║██║     ██╔═══╝ ██║
╚██████╔╝███████╗██║     ██║
 ╚═════╝ ╚══════╝╚═╝     ╚═╝

        EASY INSTALLER

      Developed by Gruponsa

EOF

echo -e "${NC}"

}

line(){

printf '%*s\n' "${COLUMNS:-60}" '' | tr ' ' '-'

}

ok(){

echo -e "${GREEN}✔${NC} $1"

}

warn(){

echo -e "${YELLOW}⚠${NC} $1"

}

fail(){

echo -e "${RED}✘${NC} $1"

exit 1

}
